In [1]:
#Add the Pandas dependency
import pandas as pd

In [2]:
#Files to load
grad_enroll=pd.read_csv('../../Grad_Enroll/grad_enroll_1213.csv')
grad_enroll

            CDS_CODE  ETHNIC  GR_12  ENR_TOTAL  GRADS  UC_GRADS
0      1100170000000       0      2         35      3         1
1      1100170000000       1      2         24      1         1
2      1100170000000       2     13        369     15        11
3      1100170000000       3      5         44      3         1
4      1100170000000       4      1         54      7         1
...              ...     ...    ...        ...    ...       ...
3282  58727700000000       4      3         13      3         3
3283  58727700000000       5     48        207     43        16
3284  58727700000000       6      2         16      2         1
3285  58727700000000       7     86        382     80        35
3286  58727700000000       9     11         64     11         3

[3287 rows x 6 columns]

In [3]:
finance_data=pd.read_csv("../../Finance Data/Finance_Data/Finance_1213.csv")
finance_data

,CDS_CODE,District_Code,Function_Code,Function,Amount
0,1100170000000,10017,2100,Classified Instructional Salaries ...,5761988.84
1,1100170000000,10017,5900,Communications ...,2126900.99
2,1100170000000,10017,7110,Tuition for Instruction Under Interdistrict At...,248316.29
3,1100170000000,10017,8110,Maintenance and Operations (Public Law 81-874)...,2607.78
4,1100170000000,10017,9200,Accounts Receivable ...,1138122.98
...,...,...,...,...,...
3993,58727510000000,72751,9200,Accounts Receivable ...,257897.98
3994,58727690000000,72769,2100,Classified Instructional Salaries ...,81262.45
3995,58727690000000,72769,4200,Books and Other Reference Materials ...,145863.48
3996,58727690000000,72769,8110,Maintenance and Operations (Public Law 81-874)...,227745.90
3997,58727690000000,72769,9200,Accounts Receivable ...,64649.82

In [4]:
grad_enroll_finance=pd.merge(grad_enroll, finance_data, on=['CDS_CODE'])
grad_enroll_finance

,CDS_CODE,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Function,Amount
0,1100170000000,0,2,35,3,1,10017,2100,Classified Instructional Salaries ...,5761988.84
1,1100170000000,0,2,35,3,1,10017,5900,Communications ...,2126900.99
2,1100170000000,0,2,35,3,1,10017,7110,Tuition for Instruction Under Interdistrict At...,248316.29
3,1100170000000,0,2,35,3,1,10017,8110,Maintenance and Operations (Public Law 81-874)...,2607.78
4,1100170000000,0,2,35,3,1,10017,9200,Accounts Receivable ...,1138122.98
...,...,...,...,...,...,...,...,...,...,...
2860,57727100000000,7,251,2582,221,115,72710,9200,Accounts Receivable ...,446835.00
2861,57727100000000,9,4,135,4,1,72710,4100,Approved Textbooks and Core Curricula Material...,62992.21
2862,57727100000000,9,4,135,4,1,72710,4200,Books and Other Reference Materials ...,292217.53
2863,57727100000000,9,4,135,4,1,72710,7110,Tuition for Instruction Under Interdistrict At...,143886.68
2864,57727100000000,9,4,135,4,1,72710,9200,Accounts Receivable ...,446835.00

In [5]:
grad_enroll_finance.to_csv('../All_Data_Data/All_1213')